# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"

# Binaries (Brew Formulae)
brew "aws-sam-cli"
brew "awscli"
brew "composer"
brew "duti"
brew "ffmpeg"
brew "gh"
brew "git"
brew "imageoptim-cli"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "pnpm"
brew "redis"
brew "sqlite"
brew "wget"
brew "wp-cli"
brew "yt-dlp"

# GUI Applications (Casks)
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "windows-app"
cask "mimestream"
cask "nordvpn"
cask "rapidapi"
cask "ray"
cask "raycast"
cask "slack"
cask "sonos"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "daisydisk"
cask "nordvpn"

# App Store Apps
mas "Peek", id: 1554235898
mas "Strongbox", id: 1481853033
mas "DevUtils", id: 1533756032
mas "Magnet", id: 441258766
mas "Shadowrocket", id: 932747118
mas "Things 3", id: 904280696
