# Binaries (Brew Formulae)
brew "aws-sam-cli"
brew "awscli"
brew "composer"
brew "coreutils"
brew "duti"
brew "ffmpeg"
brew "gh"
brew "git"
brew "imagemagick"
brew "imageoptim-cli"
brew "jq"
brew "mas"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "pnpm"
brew "redis"
brew "sqlite"
brew "tmuxinator"
brew "wget"
brew "wp-cli"
brew "yt-dlp"

# GUI Applications (Casks)
cask "affinity"
cask "claude"
cask "codexbar"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "herd"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "logitech-g-hub"
cask "mimestream"
cask "nordvpn"
cask "orbstack"
cask "phpstorm"
cask "postman"
cask "rapidapi"
cask "ray"
cask "raycast"
cask "rsyncui"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "telegram"
cask "tinkerwell"
cask "tower"
cask "transmit"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "windows-app"

# App Store Apps
mas "DevUtils", id: 1533756032
mas "Magnet", id: 441258766
mas "Peek", id: 1554235898
mas "Rename It", id: 443773246
mas "Shadowrocket", id: 932747118
mas "Strongbox", id: 1481853033
mas "Things 3", id: 904280696
